dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm55/main.c
/* DC IRQ Config */
cy_stc_sysint_t dc_irq_cfg =
{
    .intrSrc      = GFXSS_DC_IRQ,
    .intrPriority = DC_INT_PRIORITY
};

/* GPU IRQ Config */
cy_stc_sysint_t gpu_irq_cfg =
{
    .intrSrc      = GFXSS_GPU_IRQ,
    .intrPriority = GPU_INT_PRIORITY
};

cy_stc_scb_i2c_context_t disp_touch_i2c_controller_context;

cy_stc_sysint_t disp_touch_i2c_controller_irq_cfg =
{
    .intrSrc      = DISPLAY_I2C_CONTROLLER_IRQ,
    .intrPriority = I2C_CONTROLLER_IRQ_PRIORITY,
};

#if defined(MTB_DISPLAY_EK79007AD3)
mtb_display_ek79007ad3_pin_config_t ek79007ad3_pin_cfg =
{
    .reset_port = CYBSP_DISP_RST_PORT,
    .reset_pin  = CYBSP_DISP_RST_PIN,
};
#endif

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
static void cm55_audio_task(void *arg);
static void start_audio_task(void);
static void configure_display_i2c_clock(void);
static void suspend_gfx_task_after_failure(const char *reason);

static bool status_is_leap_year(uint16_t year)
{
    return (((year % 4U) == 0U) &&
            (((year % 100U) != 0U) || ((year % 400U) == 0U)));
}

static uint8_t status_days_in_month(uint16_t year, uint8_t month)
{
    static const uint8_t days_per_month[] =
    {
        31U, 28U, 31U, 30U, 31U, 30U,
        31U, 31U, 30U, 31U, 30U, 31U
    };

    if ((month < 1U) || (month > 12U))
    {
        return 31U;
    }

    if ((month == 2U) && status_is_leap_year(year))
    {
        return 29U;
    }

    return days_per_month[month - 1U];
}

static void status_advance_one_day(void)
{
    if ((status_clock_year == 0U) ||
        (status_clock_month == 0U) ||
        (status_clock_day == 0U))
    {
        return;
    }

    status_clock_day++;
    if (status_clock_day > status_days_in_month(status_clock_year,
                                                status_clock_month))
    {
        status_clock_day = 1U;
        status_clock_month++;
        if (status_clock_month > 12U)
        {
            status_clock_month = 1U;
            status_clock_year++;
        }
    }
}

static void update_hachimitsu_status_text(void)
{
    if ((status_date_label != NULL) || (status_time_label != NULL))
    {
        uint16_t shared_year;
        uint8_t shared_month;
        uint8_t shared_day;
        uint8_t shared_hour;
        uint8_t shared_min;
        uint8_t shared_sec;

        if (shared_mem_get_datetime(&shared_year, &shared_month, &shared_day,
                                    &shared_hour, &shared_min, &shared_sec))
        {
            status_clock_year = shared_year;
            status_clock_month = shared_month;
            status_clock_day = shared_day;
            status_clock_hour = shared_hour;
            status_clock_min = shared_min;
            status_clock_sec = shared_sec;
        }

        if (status_date_label != NULL)
        {
            if ((status_clock_year != 0U) &&
                (status_clock_month != 0U) &&
                (status_clock_day != 0U))
            {
                lv_label_set_text_fmt(status_date_label,
                                      "%04u-%02u-%02u",
                                      (unsigned int)status_clock_year,
                                      (unsigned int)status_clock_month,
                                      (unsigned int)status_clock_day);
            }
            else
            {
                lv_label_set_text(status_date_label, "---- -- --");
            }
        }

        if (status_time_label != NULL)
        {
            lv_label_set_text_fmt(status_time_label,
                                  "%02u:%02u:%02u",
                                  (unsigned int)status_clock_hour,
                                  (unsigned int)status_clock_min,
                                  (unsigned int)status_clock_sec);
        }
    }

    if (status_mowo_count_label != NULL)
    {
        uint32_t mowo_count = audio_get_high_confidence_upload_count();

        if (mowo_count != status_mowo_last_count)
        {
            lv_label_set_text_fmt(status_mowo_count_label,
                                  "%lu",
                                  (unsigned long)mowo_count);
            status_mowo_last_count = mowo_count;
        }
    }
}

static void hachimitsu_status_timer_cb(lv_timer_t *timer)
{
    CY_UNUSED_PARAMETER(timer);

    status_clock_sec++;
    if (status_clock_sec >= 60U)
    {
        status_clock_sec = 0U;
        status_clock_min++;
        if (status_clock_min >= 60U)
        {
            status_clock_min = 0U;
            status_clock_hour = (uint8_t)((status_clock_hour + 1U) % 24U);
            if (status_clock_hour == 0U)
            {
                status_advance_one_day();
            }
        }
    }
    update_hachimitsu_status_text();
}

/*******************************************************************************
* Function Name: create_hachimitsu_status_screen
********************************************************************************
* Summary:
*  Creates a small LVGL screen so the display path can be verified without
*  depending on optional LVGL demo assets.
*
*******************************************************************************/
static void create_hachimitsu_status_screen(void)
{
    lv_obj_t *scr = lv_screen_active();
    lv_obj_t *accent_line;
    lv_obj_t *time_panel;
    lv_obj_t *mowo_panel;
    lv_obj_t *time_accent;
    lv_obj_t *mowo_accent;
    lv_obj_t *time_caption;
    lv_obj_t *mowo_caption;
    lv_obj_t *mowo_name_label;
    lv_obj_t *confidence_label;

    lv_obj_set_style_bg_color(scr, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);

    status_title_label = lv_label_create(scr);
    lv_obj_set_width(status_title_label, ACTUAL_DISP_HOR_RES);
    lv_label_set_long_mode(status_title_label, LV_LABEL_LONG_CLIP);
    lv_label_set_text(status_title_label, "Hachimitsu Detector");
    lv_obj_set_style_text_color(status_title_label, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_text_align(status_title_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(status_title_label, &lv_font_montserrat_36, LV_PART_MAIN);
    lv_obj_align(status_title_label, LV_ALIGN_TOP_MID, 0, 24);

    accent_line = lv_obj_create(scr);
    lv_obj_set_size(accent_line, 332, 4);
    lv_obj_set_style_bg_color(accent_line, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(accent_line, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_width(accent_line, 0, LV_PART_MAIN);
    lv_obj_set_style_radius(accent_line, 2, LV_PART_MAIN);
    lv_obj_clear_flag(accent_line, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_align(accent_line, LV_ALIGN_TOP_MID, 0, 78);

