dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm55/main.c
    time_panel = lv_obj_create(scr);
    lv_obj_set_size(time_panel, 330, 212);
    lv_obj_align(time_panel, LV_ALIGN_LEFT_MID, 44, 54);
    lv_obj_set_style_bg_color(time_panel, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(time_panel, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_color(time_panel, lv_color_hex(0x1F6FEB), LV_PART_MAIN);
    lv_obj_set_style_border_width(time_panel, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(time_panel, 8, LV_PART_MAIN);
    lv_obj_set_style_pad_all(time_panel, 0, LV_PART_MAIN);
    lv_obj_clear_flag(time_panel, LV_OBJ_FLAG_SCROLLABLE);

    time_accent = lv_obj_create(time_panel);
    lv_obj_set_size(time_accent, 6, 168);
    lv_obj_set_style_bg_color(time_accent, lv_color_hex(0x1F6FEB), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(time_accent, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_width(time_accent, 0, LV_PART_MAIN);
    lv_obj_set_style_radius(time_accent, 3, LV_PART_MAIN);
    lv_obj_clear_flag(time_accent, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_align(time_accent, LV_ALIGN_LEFT_MID, 18, 0);

    time_caption = lv_label_create(time_panel);
    lv_obj_set_width(time_caption, 250);
    lv_label_set_long_mode(time_caption, LV_LABEL_LONG_CLIP);
    lv_label_set_text(time_caption, "CURRENT TIME");
    lv_obj_set_style_text_color(time_caption, lv_color_hex(0x8FBFFF), LV_PART_MAIN);
    lv_obj_set_style_text_font(time_caption, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_align(time_caption, LV_ALIGN_TOP_LEFT, 40, 28);

    status_date_label = lv_label_create(time_panel);
    lv_obj_set_width(status_date_label, 250);
    lv_label_set_long_mode(status_date_label, LV_LABEL_LONG_CLIP);
    lv_obj_set_style_text_color(status_date_label, lv_color_hex(0xAEB7C2), LV_PART_MAIN);
    lv_obj_set_style_text_align(status_date_label, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    lv_obj_set_style_text_font(status_date_label, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_align(status_date_label, LV_ALIGN_LEFT_MID, 40, -12);

    status_time_label = lv_label_create(time_panel);
    lv_obj_set_width(status_time_label, 250);
    lv_label_set_long_mode(status_time_label, LV_LABEL_LONG_CLIP);
    lv_obj_set_style_text_color(status_time_label, lv_color_hex(0xEAF4FF), LV_PART_MAIN);
    lv_obj_set_style_text_align(status_time_label, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    lv_obj_set_style_text_font(status_time_label, &lv_font_montserrat_36, LV_PART_MAIN);
    lv_obj_align(status_time_label, LV_ALIGN_LEFT_MID, 40, 38);

    mowo_panel = lv_obj_create(scr);
    lv_obj_set_size(mowo_panel, 350, 212);
    lv_obj_align(mowo_panel, LV_ALIGN_RIGHT_MID, -44, 54);
    lv_obj_set_style_bg_color(mowo_panel, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(mowo_panel, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_color(mowo_panel, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_border_width(mowo_panel, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(mowo_panel, 8, LV_PART_MAIN);
    lv_obj_set_style_pad_all(mowo_panel, 0, LV_PART_MAIN);
    lv_obj_clear_flag(mowo_panel, LV_OBJ_FLAG_SCROLLABLE);

    mowo_accent = lv_obj_create(mowo_panel);
    lv_obj_set_size(mowo_accent, 6, 168);
    lv_obj_set_style_bg_color(mowo_accent, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(mowo_accent, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_width(mowo_accent, 0, LV_PART_MAIN);
    lv_obj_set_style_radius(mowo_accent, 3, LV_PART_MAIN);
    lv_obj_clear_flag(mowo_accent, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_align(mowo_accent, LV_ALIGN_LEFT_MID, 18, 0);

    mowo_caption = lv_label_create(mowo_panel);
    lv_obj_set_width(mowo_caption, 260);
    lv_label_set_long_mode(mowo_caption, LV_LABEL_LONG_CLIP);
    lv_label_set_text(mowo_caption, "DETECTIONS");
    lv_obj_set_style_text_color(mowo_caption, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_text_font(mowo_caption, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_align(mowo_caption, LV_ALIGN_TOP_LEFT, 40, 28);

    mowo_name_label = lv_label_create(mowo_panel);
    lv_obj_set_width(mowo_name_label, 172);
    lv_label_set_long_mode(mowo_name_label, LV_LABEL_LONG_CLIP);
    lv_label_set_text(mowo_name_label, "MOWO number:");
    lv_obj_set_style_text_color(mowo_name_label, lv_color_hex(0xEAF4FF), LV_PART_MAIN);
    lv_obj_set_style_text_font(mowo_name_label, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_align(mowo_name_label, LV_ALIGN_LEFT_MID, 40, 10);

    status_mowo_count_label = lv_label_create(mowo_panel);
    lv_obj_set_width(status_mowo_count_label, 104);
    lv_label_set_long_mode(status_mowo_count_label, LV_LABEL_LONG_CLIP);
    lv_label_set_text(status_mowo_count_label, "0");
    lv_obj_set_style_text_color(status_mowo_count_label, lv_color_hex(0xF8E16C), LV_PART_MAIN);
    lv_obj_set_style_text_align(status_mowo_count_label, LV_TEXT_ALIGN_RIGHT, LV_PART_MAIN);
    lv_obj_set_style_text_font(status_mowo_count_label, &lv_font_montserrat_36, LV_PART_MAIN);
    lv_obj_align(status_mowo_count_label, LV_ALIGN_RIGHT_MID, -32, 0);

    confidence_label = lv_label_create(mowo_panel);
    lv_obj_set_width(confidence_label, 260);
    lv_label_set_long_mode(confidence_label, LV_LABEL_LONG_CLIP);
    lv_label_set_text(confidence_label, "(confidence>0.95)");
    lv_obj_set_style_text_color(confidence_label, lv_color_hex(0xAEB7C2), LV_PART_MAIN);
    lv_obj_set_style_text_font(confidence_label, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_align(confidence_label, LV_ALIGN_BOTTOM_LEFT, 40, -30);

    status_clock_year = 0U;
    status_clock_month = 0U;
    status_clock_day = 0U;
    status_clock_hour = 0U;
    status_clock_min = 0U;
    status_clock_sec = 0U;
    status_mowo_last_count = 0xFFFFFFFFUL;
    update_hachimitsu_status_text();
    lv_obj_invalidate(scr);

    (void)lv_timer_create(hachimitsu_status_timer_cb,
                          STATUS_TIMER_PERIOD_MS,
                          NULL);
}

/*******************************************************************************
* Function Name: start_audio_task
********************************************************************************
* Summary:
*  Starts the CM55 audio detector task once. The graphics task calls this only
*  after the display path has settled, so panel probing does not starve audio.
*
*******************************************************************************/
static void start_audio_task(void)
{
    if (NULL == rtos_cm55_audio_task_handle)
    {
        BaseType_t audio_task_return = xTaskCreate(cm55_audio_task,
                                                   AUDIO_TASK_NAME,
                                                   AUDIO_TASK_STACK_SIZE,
                                                   NULL,
                                                   AUDIO_TASK_PRIORITY,
                                                   &rtos_cm55_audio_task_handle);

        if (pdPASS != audio_task_return)
        {
            printf("Error: Failed to create CM55 audio task.\r\n");
            handle_app_error();
        }
    }
}

