dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm55/main.c
/*******************************************************************************
* Function Name: configure_display_i2c_clock
********************************************************************************
* Summary:
*  The Waveshare 4.3-inch DSI panel controller supports 100 kHz I2C. The base
*  BSP config uses the same SCB0 controller at a faster rate, so adjust only
*  the display clock divider before initializing the panel bus.
*
*******************************************************************************/
static void configure_display_i2c_clock(void)
{
#if defined(MTB_DISPLAY_W4P3INCH_RPI)
    uint32_t current_divider;
    uint32_t current_pclk_hz;
    uint32_t source_hz;
    uint32_t target_pclk_hz;
    uint32_t new_divider_plus_one;
    uint32_t new_divider;
    uint32_t new_pclk_hz;
    uint32_t oversample =
        (uint32_t)DISPLAY_I2C_CONTROLLER_config.lowPhaseDutyCycle +
        (uint32_t)DISPLAY_I2C_CONTROLLER_config.highPhaseDutyCycle;

    if (0U == oversample)
    {
        oversample = 1U;
    }

    current_divider =
        Cy_SysClk_PeriPclkGetDivider((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                     DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                     DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM);
    current_pclk_hz =
        Cy_SysClk_PeriPclkGetFrequency((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM);

    source_hz = current_pclk_hz * (current_divider + 1U);
    target_pclk_hz = W4P3_DISPLAY_I2C_TARGET_HZ * oversample;
    new_divider_plus_one = (source_hz + target_pclk_hz - 1U) / target_pclk_hz;
    if (0U == new_divider_plus_one)
    {
        new_divider_plus_one = 1U;
    }
    new_divider = new_divider_plus_one - 1U;

    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                     DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                     DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM);
    (void)Cy_SysClk_PeriPclkSetDivider((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM,
                                       new_divider);
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                    DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                    DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM);

    new_pclk_hz =
        Cy_SysClk_PeriPclkGetFrequency((en_clk_dst_t)DISPLAY_I2C_CONTROLLER_CLK_DIV_GRP_NUM,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_HW,
                                       DISPLAY_I2C_CONTROLLER_CLK_DIV_NUM);
    printf("[GFX] Display I2C clock pclk %lu -> %lu Hz, bus ~= %lu Hz\r\n",
           (unsigned long)current_pclk_hz,
           (unsigned long)new_pclk_hz,
           (unsigned long)(new_pclk_hz / oversample));
#endif
}

/*******************************************************************************
* Function Name: shutdown_gfx_resources
********************************************************************************
* Summary:
*  Turns off display-side peripherals when LVGL cannot finish initialization.
*
*******************************************************************************/
static void shutdown_gfx_resources(void)
{
    if (display_i2c_initialized)
    {
        NVIC_DisableIRQ(disp_touch_i2c_controller_irq_cfg.intrSrc);
        Cy_SCB_I2C_Disable(DISPLAY_I2C_CONTROLLER_HW,
                           &disp_touch_i2c_controller_context);
        display_i2c_initialized = false;
    }

    if (gfxss_initialized)
    {
        NVIC_DisableIRQ(GFXSS_DC_IRQ);
        NVIC_DisableIRQ(GFXSS_GPU_IRQ);
        Cy_GFXSS_Disable_GPU_Interrupt(GFXSS);
        Cy_GFXSS_Clear_DC_Interrupt(GFXSS, &gfx_context);
        Cy_GFXSS_Clear_GPU_Interrupt(GFXSS, &gfx_context);
        (void)Cy_GFXSS_DeInit(GFXSS, &gfx_context);
        gfxss_initialized = false;
    }
}

/*******************************************************************************
* Function Name: suspend_gfx_task_after_failure
********************************************************************************
* Summary:
*  Keeps CM55 alive when the optional display path cannot initialize. This lets
*  audio detection continue and leaves enough diagnostics on UART to fix the
*  display wiring/configuration.
*
*******************************************************************************/
static void suspend_gfx_task_after_failure(const char *reason)
{
    printf("[GFX] %s\r\n", reason);
    shutdown_gfx_resources();
    printf("[GFX] LVGL display task suspended after cleanup; audio task will continue.\r\n");
    start_audio_task();

    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(1000U));
    }
}

/* LPTimer HAL object */
static mtb_hal_lptimer_t lptimer_obj;

/* RTC HAL object */
static mtb_hal_rtc_t rtc_obj;

#if (configGENERATE_RUN_TIME_STATS == 1)
/*******************************************************************************
* Function Name: setup_run_time_stats_timer
********************************************************************************
* Summary:
*  This function configuresTCPWM 0 GRP 0 Counter 0 as the timer source for
*  FreeRTOS runtime statistics.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void setup_run_time_stats_timer(void)
{
    /* Initialze TCPWM block with required timer configuration */
    if (CY_TCPWM_SUCCESS != Cy_TCPWM_Counter_Init(CYBSP_GENERAL_PURPOSE_TIMER_HW,
                                                CYBSP_GENERAL_PURPOSE_TIMER_NUM,
                                           &CYBSP_GENERAL_PURPOSE_TIMER_config))
    {
        handle_app_error();
    }

    /* Enable the initialized counter */
    Cy_TCPWM_Counter_Enable(CYBSP_GENERAL_PURPOSE_TIMER_HW,
                            CYBSP_GENERAL_PURPOSE_TIMER_NUM);

    /* Start the counter */
    Cy_TCPWM_TriggerStart_Single(CYBSP_GENERAL_PURPOSE_TIMER_HW,
                                 CYBSP_GENERAL_PURPOSE_TIMER_NUM);
}


