dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm55/main.c
        if (CY_SCB_I2C_SUCCESS != i2c_result)
        {
            printf("I2C controller initialization failed with status = 0x%08lX\r\n",
                   (unsigned long)i2c_result);
            suspend_gfx_task_after_failure("Display/touch I2C initialization failed.");
        }

        /* Initialize the I2C interrupt */
        sysint_status = Cy_SysInt_Init(&disp_touch_i2c_controller_irq_cfg,
                                       &disp_touch_i2c_controller_interrupt);

        if (CY_SYSINT_SUCCESS != sysint_status)
        {
            printf("I2C controller interrupt initialization failed\r\n");
            suspend_gfx_task_after_failure("Display/touch I2C interrupt initialization failed.");
        }

        /* Enable the I2C interrupts. */
        NVIC_EnableIRQ(disp_touch_i2c_controller_irq_cfg.intrSrc);

        /* Enable the I2C */
        Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);
        display_i2c_initialized = true;

        vTaskDelay(pdMS_TO_TICKS(DISPLAY_STABILIZATION_DELAY_MS));

#if defined(MTB_DISPLAY_WS7P0DSI_RPI)
        /* Initialize the RPI display */
        status = mtb_disp_ws7p0dsi_panel_init(DISPLAY_I2C_CONTROLLER_HW,
                                              &disp_touch_i2c_controller_context);

        if (CY_RSLT_SUCCESS != status)
        {
            printf("Waveshare 7-Inch R-Pi display init failed with status = %u\r\n", (unsigned int) status);
            suspend_gfx_task_after_failure("Waveshare 7-inch display initialization failed.");
        }

#elif defined(MTB_DISPLAY_EK79007AD3)
        /* Initialize the WF101JTYAHMNB0 display driver. */
        mipi_status = mtb_display_ek79007ad3_init(GFXSS_GFXSS_MIPIDSI,
                                                  &ek79007ad3_pin_cfg);

        if (CY_MIPIDSI_SUCCESS != mipi_status)
        {
            printf("WF101JTYAHMNB0 10-inch display init failed with status = %d\r\n", mipi_status);
            suspend_gfx_task_after_failure("WF101JTYAHMNB0 display initialization failed.");
        }

#elif defined(MTB_DISPLAY_W4P3INCH_RPI)

        for (uint32_t attempt = 1U; attempt <= DISPLAY_INIT_RETRY_COUNT; attempt++)
        {
            /* Initialize the Waveshare 4.3-Inch display */
            i2c_result = mtb_disp_waveshare_4p3_init(DISPLAY_I2C_CONTROLLER_HW,
                                                      &disp_touch_i2c_controller_context);

            if (CY_SCB_I2C_SUCCESS == i2c_result)
            {
                break;
            }

            printf("Waveshare 4.3-Inch display init attempt %lu/%lu failed "
                   "with status = 0x%08lX (%lu)\r\n",
                   (unsigned long)attempt,
                   (unsigned long)DISPLAY_INIT_RETRY_COUNT,
                   (unsigned long)i2c_result,
                   (unsigned long)i2c_result);

            if (attempt < DISPLAY_INIT_RETRY_COUNT)
            {
                vTaskDelay(pdMS_TO_TICKS(DISPLAY_INIT_RETRY_DELAY_MS));
            }
        }

        if (CY_SCB_I2C_SUCCESS != i2c_result)
        {
            suspend_gfx_task_after_failure("Waveshare 4.3-inch display initialization failed.");
        }
#endif
        /* Allocate memory for VGLite from the vglite_heap_base */
        vg_module_parameters_t vg_params;
        vg_params.register_mem_base = (uint32_t)GFXSS_GFXSS_GPU_GCNANO;
        vg_params.gpu_mem_base[VG_PARAMS_POS] = GPU_MEM_BASE;
        vg_params.contiguous_mem_base[VG_PARAMS_POS] = vglite_heap_base;
        vg_params.contiguous_mem_size[VG_PARAMS_POS] = VGLITE_HEAP_SIZE;

        /* Initialize VGlite memory. */
        vg_lite_init_mem(&vg_params);

        /* Initialize the memory and data structures needed for VGLite draw/blit
         * functions
         */
        vglite_status = vg_lite_init((MY_DISP_HOR_RES),
                             (MY_DISP_VER_RES));

        if (VG_LITE_SUCCESS == vglite_status)
        {
            /* Initialize LVGL library */
            lv_init();
            lv_port_disp_init();

            /* Initialize touch input and draw the application status screen. */
            lv_port_indev_init();
            create_hachimitsu_status_screen();
            start_audio_task();
        }
        else
        {
            printf("vg_lite_init failed, status: %d\r\n", vglite_status);

            /* Deallocate all the resources and free up all the memory */
            vg_lite_close();
            suspend_gfx_task_after_failure("VG-Lite initialization failed.");
        }
    }
    else
    {
        printf("Graphics subsystem init failed, status: %d\r\n", gfx_status);
        suspend_gfx_task_after_failure("Graphics subsystem initialization failed.");
    }

    for (;;)
    {
        /* LVGL's timer handler function, to be called periodically to handle
         * LVGL tasks.
         */
        time_till_next = lv_timer_handler();
        if (time_till_next == 0U)
        {
            time_till_next = 1U;
        }
        vTaskDelay(pdMS_TO_TICKS(time_till_next));
    }
}

/*******************************************************************************
* Function Name: cm55_audio_task
********************************************************************************
* Summary:
*  Initializes the shared memory channel and audio detector, then continuously
*  processes PDM frames on CM55.
*
*******************************************************************************/
static void cm55_audio_task(void *arg)
{
    CY_UNUSED_PARAMETER(arg);

    cy_rslt_t result = CY_RSLT_SUCCESS;

    shared_mem_init();

    result = pdm_init();
    if(CY_RSLT_SUCCESS != result)
    {
        printf("Audio initialization failed, status: %lu\r\n",
               (unsigned long) result);
        handle_app_error();
    }

    printf("========== Audio detector initialized ==========\r\n");
    printf("SAMPLE_RATE: %d\r\n", SAMPLE_RATE);
    printf("STEP_SIZE_SEC: %f\r\n", STEP_SIZE_SEC);
    printf("OUTPUT_THRESHOLD_SCORE: %f\r\n", OUTPUT_THRESHOLD_SCORE);
    printf("WINDOW_SIZE: %f\r\n", WINDOW_SIZE);
    printf("WINDOW_SIZE_SAMPLES: %d\r\n", WINDOW_SIZE_SAMPLES);
    printf("STEP_SIZE_SAMPLES: %d\r\n\r\n", STEP_SIZE_SAMPLES);

    for(;;)
    {
        if(PDM_PCM_DATA_NOT_READY == pdm_data_process())
        {
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
}

